// function processDoll(doll) {
//
//     // Базовый случай
//     if ("нашли кусочек шоколада") {
//         return "Ням-ням";
//     } else if ("больше нету кукол") {
//         return "Шоколад не найден"
//     }
//
//
//     // Рекурсивный вызов самой себя (функции)
//     else {
//         return processDoll("Кукла поменьше")
//     }
//
// }
//
// // Шоколад
//
// Большая матрешка
//     Матрешка поменьше 1
//         Матрешка поменьше 2
//             Матрешка поменьше 3
//                 Матрешка поменьше 4
//                     Матрешка поменьше 5
//                         Матрешка поменьше 6
//